exemplo/app/controllers/home_controller.rb

SELECT * FROM "projects" WHERE ("projects"."id" = 1)
---
  def index
    project_id = session[:project_id]
    if project_id
      project = Project.find project_id