exemplo/app/controllers/home_controller.rb

  def index
    @ns_tasks = Task.find_all_by_status(0);
---
SELECT * FROM "tasks" WHERE ("tasks".project_id = 1) AND ((status=0) AND ("tasks".project_id = 1))

      task = Task.find(task_id)
      new_status = params[:status].to_i
      old_status = task.status
      task.status = new_status
      if task.save
---
SELECT * FROM "tasks" WHERE ("tasks"."id" = 0)
UPDATE "tasks" SET "updated_at" = '2009-10-24 14:18:27', "status" = 1 WHERE "id" = 5