exemplo/app/controllers/projects_controller.rb

  def create
    @project = Project.new(params[:project])

    respond_to do |format|
      if @project.save
---
INSERT INTO "projects" ("name", "created_at", "updated_at", "description") VALUES('Other Project', '2009-10-25 13:32:20', '2009-10-25 13:32:20', 'Just for Testing')