exemplo/app/controllers/tasks_controller.rb

  def index
    @tasks = Task.all
---
SELECT * FROM "tasks"

  def create
    @task = Task.new(params[:task])
    @task.project_id = params[:project_id]
    @project = Project.find(params[:project_id])
    @tasks = @project.tasks
    @nt = Task.new :project_id => @project.id
    respond_to do |format|
      if @task.save
        format.html { redirect_to(@task) }
        format.xml  { render :xml => @task, :status => :created, :location => @task }
        format.js {render :update do |page|
          page.replace_html 'tablebody', :partial => 'projects/tasks_table'
        end
        }
      else
        format.html { render :action => "new" }
        format.xml  { render :xml => @task.errors, :status => :unprocessable_entity }
        format.js { render :update do |page|
          page.alert @task.error.full_messages.join('\n')
---
SELECT * FROM "projects" WHERE ("projects"."id" = 1)
INSERT INTO "tasks" ("created_at", "title", "project_id", "updated_at", "priority", "description", "status") VALUES('2009-10-24 13:50:03', 'Cadastro de usuários', NULL, '2009-10-24 13:50:03', 0, 'Criar um cadastro simples de usuários', 0)
SELECT * FROM "projects"
SELECT * FROM "tasks" WHERE ("tasks".project_id = 1)

  def destroy
    @task = Task.find(params[:id])
    @task.destroy
    @project = Project.find(params[:projectid])
---
SELECT * FROM "tasks" WHERE ("tasks".project_id = 1)
DELETE FROM "tasks" WHERE "id" = 6
SELECT * FROM "projects" WHERE ("projects"."id" = 1)